examples/render_all_grammars/dot/tests_functional_test_scoping_metamodel_provider3_Base.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


40465528[ label="{Cls|+name:ID\l}"]

40225080[ label="{Method|+name:ID\l}"]

40075432[ label="{Obj|+name:ID\l}"]

39861032[ label="{Call|+name:ID\l}"]

39974056[ label="{Import|+importURI:STRING\l}"]

40447656[ label="{Comment|\\/\\/.*}"]

39583704[ label="{ID|}"]

40470424[ label="{STRING|}"]

40599032[ label="{BOOL|}"]

40126392[ label="{INT|}"]

40113016[ label="{FLOAT|}"]

39844456[ label="{STRICTFLOAT|}"]

40097000[ label="{NUMBER|}"]

39804936[ label="{BASETYPE|}"]

40131576[ label="{*OBJECT|}"]



40465528 -> 40465528[headlabel="extends 1..*"]
40465528 -> 40225080[arrowtail=diamond, dir=both, headlabel="methods 1..*"]
40075432 -> 40465528[headlabel="ref "]
39861032 -> 40075432[headlabel="obj "]
39861032 -> 40225080[headlabel="method "]
40097000 -> 39844456 [dir=back]
40097000 -> 40126392 [dir=back]
39804936 -> 40097000 [dir=back]
39804936 -> 40113016 [dir=back]
39804936 -> 40599032 [dir=back]
39804936 -> 39583704 [dir=back]
39804936 -> 40470424 [dir=back]
40131576 -> 39804936 [dir=back]

}
