examples/render_all_grammars/pu/tests_functional_test_scoping_metamodel_provider3_Base.pu
@startuml
set namespaceSeparator .


class Base.Cls  {
  ID name
}


class Base.Method  {
  ID name
}


class Base.Obj  {
  ID name
}


class Base.Call  {
  ID name
}


class Base.Import  {
  STRING importURI
}


class Base.Comment <<match>> {
}


class ID <<match>> {
}


class STRING <<match>> {
}


class BOOL <<match>> {
}


class INT <<match>> {
}


class FLOAT <<match>> {
}


class STRICTFLOAT <<match>> {
}


class NUMBER <<match>> {
}


class BASETYPE <<match>> {
}


class OBJECT <<abstract>> {
}


Base.Cls o-- "1..*" Base.Cls
Base.Cls *-- "1..*" Base.Method
Base.Obj o-- Base.Cls
Base.Call o-- Base.Obj
Base.Call o-- Base.Method
NUMBER <|-- STRICTFLOAT
NUMBER <|-- INT
BASETYPE <|-- NUMBER
BASETYPE <|-- FLOAT
BASETYPE <|-- BOOL
BASETYPE <|-- ID
BASETYPE <|-- STRING
OBJECT <|-- BASETYPE
@enduml
